import os
from handlers.menu_handlers import run_port_scanner,run_ip_scanner,option_name

def clear_screen():
    os.system('cls' if os.name == 'nt' else 'clear')

def show_banner():
    print("""
 █████   █████                                   ███████████                   ████         
▒▒███   ▒▒███                                   ▒█▒▒▒███▒▒▒█                  ▒▒███         
 ▒███    ▒███  ████████   ██████  █████ █████   ▒   ▒███  ▒   ██████   ██████  ▒███   █████ 
 ▒███    ▒███ ▒▒███▒▒███ ███▒▒███▒▒███ ▒▒███        ▒███     ███▒▒███ ███▒▒███ ▒███  ███▒▒  
 ▒▒███   ███   ▒███ ▒▒▒ ▒███████  ▒▒▒█████▒         ▒███    ▒███ ▒███▒███ ▒███ ▒███ ▒▒█████ 
  ▒▒▒█████▒    ▒███     ▒███▒▒▒    ███▒▒▒███        ▒███    ▒███ ▒███▒███ ▒███ ▒███  ▒▒▒▒███
    ▒▒███      █████    ▒▒██████  █████ █████       █████   ▒▒██████ ▒▒██████  █████ ██████ 
     ▒▒▒      ▒▒▒▒▒      ▒▒▒▒▒▒  ▒▒▒▒▒ ▒▒▒▒▒       ▒▒▒▒▒     ▒▒▒▒▒▒   ▒▒▒▒▒▒  ▒▒▒▒▒ ▒▒▒▒▒▒  
                                                                                            
            Tools Network By Vex V1.0                                                                                            
    """)

def main():
    clear_screen()
    show_banner()
    option_name()

    menu_actions = {
        '1': run_port_scanner,
        '2': run_ip_scanner,
        '3': exit
    }

    while True:
      
      select = input("\nSelect Option: ")

      if select in menu_actions:
          if select == '3': break
          menu_actions[select]()
      else:
          input("Invalid option...")

if __name__ == "__main__":
    main()